sunzhongmeng/ESP32-Tools/src/main.cpp
#if defined(PLATFORMIO) || defined(ESP32_UART_INCLUDED_FROM_INO)

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <mbedtls/base64.h>
#include <mbedtls/sha1.h>
#include <ctype.h>
#include <string.h>

#if __has_include("wifi_config.h")
#include "wifi_config.h"
#endif

#ifndef ESP32_TOOLS_STA_SSID
#define ESP32_TOOLS_STA_SSID "YOUR_WIFI_SSID"
#endif

#ifndef ESP32_TOOLS_STA_PASSWORD
#define ESP32_TOOLS_STA_PASSWORD "YOUR_WIFI_PASSWORD"
#endif

static const char *STA_WIFI_SSID = ESP32_TOOLS_STA_SSID;
static const char *STA_WIFI_PASSWORD = ESP32_TOOLS_STA_PASSWORD;

static const uint16_t HTTP_PORT = 80;
static const uint16_t WS_PORT = 81;
static const uint8_t MAX_WS_CLIENTS = 4;
static const size_t WS_MAX_PAYLOAD = 2048;
static const size_t UART_RX_BATCH = 512;

static const int WIFI_MODE_SELECT_PIN = 34;  // High at boot: join LAN. Low: AP mode.
static const int UART_TX_LED_PIN = 35;       // GPIO35 is input-only on ESP32-WROOM-32.
static const int UART_RX_LED_PIN = 32;
static const int SYSTEM_LED_PIN = 33;

static const int DEFAULT_UART_RX_PIN = 16;
static const int DEFAULT_UART_TX_PIN = 17;
static const uint32_t DEFAULT_BAUD = 115200;
static const char *AP_SSID = "ESP32-Tools";
static const char *AP_PASSWORD = "12345678";
static const uint32_t UART_LED_PULSE_MS = 60;
static const uint32_t SYSTEM_LED_BLINK_MS = 500;

IPAddress STA_STATIC_IP(192, 168, 0, 201);
IPAddress STA_GATEWAY(192, 168, 0, 1);
IPAddress STA_SUBNET(255, 255, 255, 0);
IPAddress STA_DNS1(192, 168, 0, 1);
IPAddress STA_DNS2(8, 8, 8, 8);

WebServer httpServer(HTTP_PORT);
WiFiServer wsServer(WS_PORT);
HardwareSerial BridgeSerial(2);

struct UartSettings {
  uint32_t baud = DEFAULT_BAUD;
  uint8_t dataBits = 8;
  char parity = 'N';
  uint8_t stopBits = 1;
  int rxPin = DEFAULT_UART_RX_PIN;
  int txPin = DEFAULT_UART_TX_PIN;
};

enum WsReadState : uint8_t {
  WS_HEADER,
  WS_EXTENDED_LEN,
  WS_MASK,
  WS_PAYLOAD
};

struct WsClient {
  WiFiClient tcp;
  bool active = false;
  WsReadState state = WS_HEADER;
  uint8_t header[2] = {0, 0};
  uint8_t headerPos = 0;
  uint8_t ext[8] = {0};
  uint8_t extNeeded = 0;
  uint8_t extPos = 0;
  uint8_t mask[4] = {0};
  uint8_t maskPos = 0;
  uint8_t opcode = 0;
  bool masked = false;
  uint64_t payloadLen = 0;
  size_t payloadPos = 0;
  uint8_t payload[WS_MAX_PAYLOAD];
  uint32_t lastSeen = 0;
};

UartSettings uartSettings;
WsClient wsClients[MAX_WS_CLIENTS];

bool apMode = false;
bool staModeRequested = false;
bool wifiFault = false;
bool uartFault = false;
bool txLedAvailable = false;
bool rxLedAvailable = false;
bool systemLedAvailable = false;
bool systemLedState = false;
String activeSsid;
String lastFaultText;
uint64_t uartRxBytes = 0;
uint64_t uartTxBytes = 0;
uint32_t txLedOffAt = 0;
uint32_t rxLedOffAt = 0;
uint32_t lastStatsMs = 0;
uint32_t lastReconnectMs = 0;
uint32_t lastSystemBlinkMs = 0;

static const char INDEX_HTML[] PROGMEM = R"HTML(
<!doctype html>
<html lang="zh-CN">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>ESP32 无线串口调试助手</title>
<style>
:root{
  --bg:#f5f7fb;
  --panel:#ffffff;
  --ink:#1f2937;
  --muted:#667085;
  --line:#d7dee8;
  --field:#f9fafb;
  --accent:#0f766e;
  --accent-weak:#e4f3f0;
  --blue:#2563eb;
  --warn:#d97706;
  --danger:#b42318;
  --ok:#039855;
  --shadow:0 10px 26px rgba(31,41,55,.08);
}
*{box-sizing:border-box}
html,body{height:100%}
body{
  margin:0;
  background:var(--bg);
  color:var(--ink);
  font-family:-apple-system,BlinkMacSystemFont,"Segoe UI","Microsoft YaHei",Arial,sans-serif;
}
button,input,select,textarea{font:inherit}
button{
  border:1px solid var(--line);
  background:#fff;
  color:var(--ink);
  border-radius:8px;
  padding:9px 13px;
  cursor:pointer;
}
button:hover{border-color:#aab4c3}
button.primary{background:var(--accent);border-color:var(--accent);color:#fff}
button.primary:hover{background:#0b655e}
button.warn{border-color:#f3c98b;color:#9a5b00;background:#fff9ee}
button.danger{border-color:#f4b4aa;color:var(--danger);background:#fff7f5}
input,select,textarea{
  width:100%;
  border:1px solid var(--line);
  border-radius:8px;
  background:var(--field);
  color:var(--ink);
  padding:9px 10px;
  outline:none;
}
input:focus,select:focus,textarea:focus{border-color:var(--accent);box-shadow:0 0 0 3px var(--accent-weak)}
label{display:grid;gap:6px;color:var(--muted);font-size:13px}
.app{max-width:1440px;margin:0 auto;padding:16px;display:grid;gap:12px}
.topbar{
  display:flex;
  justify-content:space-between;
  align-items:flex-start;
  gap:16px;
  padding:14px 16px;
  background:var(--panel);
  border:1px solid var(--line);
  border-radius:8px;
  box-shadow:var(--shadow);
}
h1,h2{margin:0;color:var(--ink);letter-spacing:0}
h1{font-size:22px;line-height:1.2}
h2{font-size:16px;line-height:1.3}
.sub{margin-top:6px;color:var(--muted);font-size:13px}
.chips{display:flex;flex-wrap:wrap;gap:8px;justify-content:flex-end}
.chip{
  display:inline-flex;
  align-items:center;
  gap:6px;
  min-height:30px;
  border:1px solid var(--line);
  border-radius:8px;
  background:#fff;
  padding:5px 9px;
  font-size:13px;
  color:var(--muted);
}
.dot{width:8px;height:8px;border-radius:50%;background:#98a2b3}
.dot.ok{background:var(--ok)}
.dot.warn{background:var(--warn)}
.dot.bad{background:var(--danger)}
.panel{
  background:var(--panel);
  border:1px solid var(--line);
  border-radius:8px;
  padding:14px;
  box-shadow:var(--shadow);
}
.panel-head{
  display:flex;
  justify-content:space-between;
  align-items:center;
  gap:12px;
  margin-bottom:12px;
}
.form-grid{
  display:grid;
  grid-template-columns:1.4fr repeat(5,1fr) auto;
  gap:10px;
  align-items:end;
}
.console-grid{
  display:grid;
  grid-template-columns:minmax(0,1.45fr) minmax(320px,.8fr);
  gap:12px;
}
.mode-row,.action-row,.inline-row{
  display:flex;
  flex-wrap:wrap;
  align-items:center;
  gap:8px;
}
.segmented{
  display:inline-flex;
  border:1px solid var(--line);
  border-radius:8px;
  overflow:hidden;
  background:#fff;
}
.segmented button{
  border:0;
  border-radius:0;
  padding:8px 12px;
  color:var(--muted);
}
.segmented button.active{background:var(--accent);color:#fff}
.console{
  height:48vh;
  min-height:340px;
  max-height:680px;
  overflow:auto;
  background:#101828;
  color:#d1fadf;
  border-radius:8px;
  border:1px solid #182230;
  padding:12px;
  white-space:pre-wrap;
  word-break:break-word;
  font:13px/1.55 Consolas,"SFMono-Regular",Menlo,monospace;
}
textarea{
  min-height:180px;
  resize:vertical;
  font:13px/1.5 Consolas,"SFMono-Regular",Menlo,monospace;
}
.check{
  width:auto;
  display:inline-flex;
  grid-template-columns:auto;
  align-items:center;
  gap:6px;
  color:var(--ink);
  font-size:13px;
}
.check input{width:auto}
.stats{
  display:grid;
  grid-template-columns:repeat(3,1fr);
  gap:8px;
  margin-top:10px;
}
.stat{
  border:1px solid var(--line);
  border-radius:8px;
  padding:9px;
  background:#fff;
}
.stat b{display:block;font-size:16px;color:var(--ink)}
.stat span{color:var(--muted);font-size:12px}
.timer{
  display:grid;
  grid-template-columns:auto minmax(90px,1fr) auto;
  gap:8px;
  align-items:center;
}
h3{margin:0;font-size:14px;line-height:1.3;color:var(--ink);letter-spacing:0}
.break-row{
  display:grid;
  grid-template-columns:minmax(120px,1fr) auto;
  gap:8px;
  align-items:end;
  margin-top:12px;
  padding-top:12px;
  border-top:1px solid var(--line);
}
.multi-panel{
  overflow:hidden;
}
.multi-head{
  display:flex;
  justify-content:space-between;
  align-items:center;
  gap:8px;
  margin-bottom:10px;
}
.multi-actions{
  display:flex;
  flex-wrap:wrap;
  gap:8px;
  margin-bottom:10px;
}
.string-scroll{
  width:100%;
  max-width:100%;
  max-height:min(34vh,360px);
  min-height:190px;
  overflow:auto;
  border:1px solid var(--line);
  border-radius:8px;
  background:#fff;
}
.string-list{
  display:grid;
  gap:8px;
  min-width:1580px;
  padding:8px;
}
.string-row{
  display:grid;
  grid-template-columns:34px minmax(180px,.75fr) 110px minmax(900px,2fr) 120px 80px 80px;
  gap:8px;
  align-items:center;
  border:1px solid var(--line);
  border-radius:8px;
  background:#fdfefe;
  padding:8px;
}
.string-row input,.string-row select{padding:7px 8px;font-size:12px}
.string-row button{padding:7px 9px;font-size:12px}
.string-row .row-enable{width:auto;justify-self:center}
.string-row .row-value{font-family:Consolas,"SFMono-Regular",Menlo,monospace}
.row-empty{
  border:1px dashed var(--line);
  border-radius:8px;
  padding:12px;
  color:var(--muted);
  text-align:center;
  background:#fff;
  font-size:13px;
}
.hidden-file{display:none}
.small{font-size:12px;color:var(--muted)}
@media (max-width:900px){
  .topbar{display:grid}
  .chips{justify-content:flex-start}
  .form-grid{grid-template-columns:repeat(2,minmax(0,1fr))}
  .form-grid button{grid-column:1/-1}
  .console-grid{grid-template-columns:1fr}
  .console{height:42vh}
  .string-scroll{max-height:360px}
  .string-list{min-width:1040px}
}
@media (max-width:520px){
  .app{padding:10px}
  .form-grid{grid-template-columns:1fr}
  .stats{grid-template-columns:1fr}
  .break-row{grid-template-columns:1fr}
  .multi-head{align-items:flex-start;display:grid}
  .string-list{min-width:980px}
}
</style>
</head>
<body>
<main class="app">
  <header class="topbar">
    <div>
      <h1>ESP32 无线串口调试助手</h1>
      <div class="sub" id="statusText">正在连接 WebSocket</div>
    </div>
    <div class="chips">
      <span class="chip"><span class="dot" id="connDot"></span><span id="connText">未连接</span></span>
      <span class="chip">IP <b id="ipText">--</b></span>
      <span class="chip">Wi-Fi <b id="wifiText">--</b></span>
      <span class="chip">MODE <b id="modeText">--</b></span>
      <span class="chip">FAULT <b id="faultText">none</b></span>
    </div>
  </header>

  <section class="panel">
    <div class="panel-head">
      <h2>串口参数</h2>
      <span class="small" id="serialText">115200 8N1</span>
    </div>
    <div class="form-grid">
      <label>波特率
        <input id="baud" list="baudList" type="number" min="300" max="2000000" value="115200">
      </label>
      <label>数据位
        <select id="dataBits">
          <option>8</option><option>7</option><option>6</option><option>5</option>
        </select>
      </label>
      <label>校验
        <select id="parity">
          <option value="N">None</option>
          <option value="E">Even</option>
          <option value="O">Odd</option>
        </select>
      </label>
      <label>停止位
        <select id="stopBits">
          <option>1</option><option>2</option>
        </select>
      </label>
      <label>RX GPIO
        <input id="rxPin" type="number" min="0" max="39" value="16">
      </label>
      <label>TX GPIO
        <input id="txPin" type="number" min="0" max="33" value="17">
      </label>
      <button class="primary" id="applyBtn">应用</button>
      <datalist id="baudList">
        <option value="9600"><option value="19200"><option value="38400">
        <option value="57600"><option value="115200"><option value="230400">
        <option value="460800"><option value="921600"><option value="1000000">
      </datalist>
    </div>
  </section>

