sunzhongmeng/ESP32-Tools/src/main.cpp
  <div class="console-grid">
    <section class="panel">
      <div class="panel-head">
        <h2>接收</h2>
        <div class="mode-row">
          <div class="segmented" id="rxModes">
            <button data-rx-mode="ascii" class="active">ASCII</button>
            <button data-rx-mode="hex">HEX</button>
          </div>
          <label class="check"><input type="checkbox" id="autoScroll" checked>自动滚动</label>
          <button class="danger" id="clearBtn">清空</button>
        </div>
      </div>
      <pre class="console" id="rxView"></pre>
      <div class="stats">
        <div class="stat"><b id="rxBytes">0</b><span>RX Bytes</span></div>
        <div class="stat"><b id="txBytes">0</b><span>TX Bytes</span></div>
        <div class="stat"><b id="clients">0</b><span>Clients</span></div>
      </div>
    </section>

    <section class="panel">
      <div class="panel-head">
        <h2>发送</h2>
        <div class="segmented" id="txModes">
          <button data-tx-mode="ascii" class="active">ASCII</button>
          <button data-tx-mode="hex">HEX</button>
        </div>
      </div>
      <textarea id="txInput" spellcheck="false" placeholder="01 03 00 00 00 02 C4 0B"></textarea>
      <div class="action-row" style="margin-top:10px">
        <label class="check"><input type="checkbox" id="appendCR">CR</label>
        <label class="check"><input type="checkbox" id="appendLF">LF</label>
        <button class="primary" id="sendBtn">发送</button>
        <button class="warn" id="stopTimerBtn">停止定时</button>
      </div>
      <div class="timer" style="margin-top:10px">
        <label class="check"><input type="checkbox" id="timerEnable">定时</label>
        <input id="timerMs" type="number" min="20" value="1000">
        <span class="small">ms</span>
      </div>
      <div class="break-row">
        <label>BREAK 时间 ms
          <input id="breakMs" type="number" min="1" max="5000" value="100">
        </label>
        <button class="warn" id="breakBtn">发送 BREAK</button>
      </div>
      <div class="sub" id="sendStatus">就绪</div>
    </section>
  </div>

  <section class="panel multi-panel">
    <div class="multi-head">
      <h2>多字符串发送</h2>
      <div class="inline-row">
        <button id="multiSendBtn" class="primary">发送勾选</button>
        <button id="multiLoopBtn">循环发送</button>
        <button id="multiStopBtn" class="warn">停止</button>
      </div>
    </div>
    <div class="multi-actions">
      <button id="addRowBtn">新增</button>
      <button id="selectAllRowsBtn">全选</button>
      <button id="selectNoneRowsBtn">全不选</button>
      <button id="importRowsBtn">导入</button>
      <button id="exportRowsBtn">导出</button>
    </div>
    <div class="string-scroll">
      <div class="string-list" id="stringList"></div>
    </div>
    <input class="hidden-file" id="importRowsFile" type="file" accept=".json,application/json">
  </section>
</main>

<script>
(() => {
  const $ = id => document.getElementById(id);
  const rxView = $("rxView");
  const enc = new TextEncoder();
  const RX_LIMIT = 262144;
  let ws;
  let reconnectTimer;
  let timerId;
  let mockRxTimer;
  let sequenceTimer;
  let rxMode = "ascii";
  let txMode = "ascii";
  let rxStore = [];
  let stringRows = [];
  let nextRowId = 1;
  let sequenceRunning = false;
  let sequenceLoop = false;
  let shownTxBytes = 0;
  const rowsStorageKey = "esp32_uart_rows_v1";
  const mockMode = location.protocol === "file:" ||
    location.hostname === "localhost" ||
    location.hostname === "127.0.0.1" ||
    new URLSearchParams(location.search).has("mock");

  function setConn(state, text) {
    const dot = $("connDot");
    dot.className = "dot " + (state || "");
    $("connText").textContent = text;
    $("statusText").textContent = text;
  }

  function wsUrl() {
    const host = location.hostname || "192.168.4.1";
    return "ws://" + host + ":81/";
  }

  function buildStatusMessage() {
    return [
      "STATUS",
      "baud=" + Number($("baud").value || 115200),
      "data=" + $("dataBits").value,
      "parity=" + $("parity").value,
      "stop=" + $("stopBits").value,
      "rx=" + Number($("rxPin").value || 16),
      "tx=" + Number($("txPin").value || 17),
      "ip=" + (mockMode ? "local-preview" : location.hostname),
      "wifi=" + (mockMode ? "Mock" : "--"),
      "ssid=" + (mockMode ? "Local Preview" : "--"),
      "select=" + (mockMode ? "PREVIEW" : "--"),
      "fault=none",
      "clients=1"
    ].join("|");
  }

  function startMock() {
    clearTimeout(reconnectTimer);
    clearInterval(mockRxTimer);
    handleText(buildStatusMessage());
    setConn("ok", "本地预览模式");
    $("sendStatus").textContent = "本地模拟已启用";
    mockRxTimer = setInterval(() => {
      const text = "RX " + new Date().toLocaleTimeString() + "  55 AA 01 02 03 04\r\n";
      appendRx(enc.encode(text));
      handleText("STAT|rx=" + rxStore.length + "|tx=" + shownTxBytes + "|clients=1");
    }, 1600);
  }

  function connect() {
    if (mockMode) {
      startMock();
      return;
    }
    clearTimeout(reconnectTimer);
    setConn("warn", "连接中");
    ws = new WebSocket(wsUrl());
    ws.binaryType = "arraybuffer";
    ws.onopen = () => {
      setConn("ok", "已连接");
      sendCommand("GET");
    };
    ws.onclose = () => {
      setConn("bad", "已断开，准备重连");
      reconnectTimer = setTimeout(connect, 1200);
    };
    ws.onerror = () => setConn("bad", "连接错误");
    ws.onmessage = event => {
      if (typeof event.data === "string") {
        handleText(event.data);
      } else if (event.data instanceof Blob) {
        event.data.arrayBuffer().then(handleBinary);
      } else {
        handleBinary(event.data);
      }
    };
  }

  function parseFields(text) {
    const parts = text.split("|");
    const type = parts.shift();
    const data = {};
    for (const part of parts) {
      const idx = part.indexOf("=");
      if (idx > -1) data[part.slice(0, idx)] = part.slice(idx + 1);
    }
    return { type, data };
  }

  function handleText(text) {
    const { type, data } = parseFields(text);
    if (type === "STATUS") {
      $("baud").value = data.baud || $("baud").value;
      $("dataBits").value = data.data || $("dataBits").value;
      $("parity").value = data.parity || $("parity").value;
      $("stopBits").value = data.stop || $("stopBits").value;
      $("rxPin").value = data.rx || $("rxPin").value;
      $("txPin").value = data.tx || $("txPin").value;
      $("ipText").textContent = data.ip || location.hostname;
      $("wifiText").textContent = data.wifi || "--";
      $("modeText").textContent = data.select || "--";
      $("faultText").textContent = data.fault || "none";
      $("clients").textContent = data.clients || "1";
      $("serialText").textContent = `${$("baud").value} ${$("dataBits").value}${$("parity").value}${$("stopBits").value}`;
      setConn("ok", "已连接");
    } else if (type === "STAT") {
      shownTxBytes = Number(data.tx || 0);
      $("rxBytes").textContent = data.rx || "0";
      $("txBytes").textContent = String(shownTxBytes);
      $("clients").textContent = data.clients || "1";
    } else if (type === "ERROR") {
      $("sendStatus").textContent = data.message || "错误";
      setConn("bad", data.message || "错误");
    } else if (type === "INFO") {
      $("sendStatus").textContent = data.message || "就绪";
    }
  }

  function sendCommand(command) {
    if (mockMode) {
      if (command.startsWith("CFG")) {
        handleText(buildStatusMessage());
        setConn("ok", "本地预览模式");
        $("sendStatus").textContent = "参数已应用到本地预览";
      } else if (command.startsWith("BREAK")) {
        const ms = Number((command.match(/ms=(\d+)/) || [0, 100])[1]);
        appendRx(enc.encode("BREAK " + ms + " ms\r\n"));
        $("sendStatus").textContent = "已模拟 BREAK " + ms + " ms";
      }
      return;
    }
    if (ws && ws.readyState === WebSocket.OPEN) ws.send(command);
  }

