sunzhongmeng/ESP32-Tools/src/main.cpp
  function hexByte(value) {
    return value.toString(16).padStart(2, "0").toUpperCase();
  }

  function bytesToAscii(bytes) {
    const out = [];
    for (let i = 0; i < bytes.length; i++) {
      const b = bytes[i];
      if (b === 10) out.push("\n");
      else if (b === 13) out.push("\r");
      else if (b === 9) out.push("\t");
      else if (b >= 32 && b <= 126) out.push(String.fromCharCode(b));
      else out.push("\\x" + hexByte(b));
    }
    return out.join("");
  }

  function bytesToHex(bytes) {
    const out = [];
    for (let i = 0; i < bytes.length; i++) out.push(hexByte(bytes[i]));
    return out.join(" ") + (out.length ? " " : "");
  }

  function formatBytes(bytes) {
    return rxMode === "hex" ? bytesToHex(bytes) : bytesToAscii(bytes);
  }

  function renderRx() {
    rxView.textContent = formatBytes(rxStore);
    if ($("autoScroll").checked) rxView.scrollTop = rxView.scrollHeight;
  }

  function appendRx(bytes) {
    const incoming = Array.from(bytes);
    let trimmed = false;
    if (incoming.length >= RX_LIMIT) {
      rxStore = incoming.slice(incoming.length - RX_LIMIT);
      trimmed = true;
    } else {
      const overflow = rxStore.length + incoming.length - RX_LIMIT;
      if (overflow > 0) {
        rxStore.splice(0, overflow);
        trimmed = true;
      }
      rxStore.push(...incoming);
    }
    if (trimmed) renderRx();
    else {
      rxView.textContent += formatBytes(incoming);
      if ($("autoScroll").checked) rxView.scrollTop = rxView.scrollHeight;
    }
  }

  function handleBinary(buffer) {
    const bytes = new Uint8Array(buffer);
    appendRx(bytes);
  }

  function parseHexInput(text) {
    const cleaned = text.replace(/0x/gi, "").replace(/[^0-9a-fA-F]/g, "");
    if (!cleaned.length) return new Uint8Array(0);
    if (cleaned.length % 2) throw new Error("HEX 字节不完整");
    const bytes = new Uint8Array(cleaned.length / 2);
    for (let i = 0; i < bytes.length; i++) {
      bytes[i] = parseInt(cleaned.slice(i * 2, i * 2 + 2), 16);
    }
    return bytes;
  }

  function parseAsciiEscapes(text) {
    const bytes = [];
    for (let i = 0; i < text.length; i++) {
      const c = text[i];
      if (c !== "\\") {
        const chunk = enc.encode(c);
        for (const b of chunk) bytes.push(b);
        continue;
      }
      const next = text[++i];
      if (next === "r") bytes.push(13);
      else if (next === "n") bytes.push(10);
      else if (next === "t") bytes.push(9);
      else if (next === "0") bytes.push(0);
      else if (next === "\\") bytes.push(92);
      else if (next === "x") {
        const hex = text.slice(i + 1, i + 3);
        if (!/^[0-9a-fA-F]{2}$/.test(hex)) throw new Error("ASCII \\xNN 转义不完整");
        bytes.push(parseInt(hex, 16));
        i += 2;
      } else if (next !== undefined) {
        bytes.push(92);
        const chunk = enc.encode(next);
        for (const b of chunk) bytes.push(b);
      } else {
        bytes.push(92);
      }
    }
    return new Uint8Array(bytes);
  }

  function buildTxBytes() {
    if (txMode === "hex") return parseHexInput($("txInput").value);
    let text = $("txInput").value;
    if ($("appendCR").checked) text += "\r";
    if ($("appendLF").checked) text += "\n";
    return enc.encode(text);
  }

  function bytesPreview(bytes, mode) {
    return mode === "hex" ? bytesToHex(bytes) : bytesToAscii(bytes);
  }

  function sendBytes(bytes, label, displayMode) {
    if (!mockMode && (!ws || ws.readyState !== WebSocket.OPEN)) {
      $("sendStatus").textContent = "WebSocket 未连接";
      return false;
    }
    if (!bytes.length) return false;
    if (!mockMode) {
      for (let i = 0; i < bytes.length; i += 512) {
        ws.send(bytes.slice(i, i + 512));
      }
    }
    shownTxBytes += bytes.length;
    $("txBytes").textContent = String(shownTxBytes);
    $("sendStatus").textContent = label + " 已发送 " + bytes.length + " bytes";
    if (mockMode) {
      const echoLabel = (displayMode || "ascii") === "hex" ? "TX HEX" : "TX ASCII";
      const echo = echoLabel + "  " + bytesPreview(bytes, displayMode || "ascii") + "\r\n";
      appendRx(enc.encode(echo));
      handleText("STAT|rx=" + rxStore.length + "|tx=" + shownTxBytes + "|clients=1");
    }
    return true;
  }

  function sendPacket() {
    let bytes;
    try {
      bytes = buildTxBytes();
    } catch (err) {
      $("sendStatus").textContent = err.message;
      return false;
    }
    return sendBytes(bytes, txMode === "hex" ? "TX HEX" : "TX ASCII", txMode);
  }

  function syncTimer() {
    clearInterval(timerId);
    timerId = null;
    if (!$("timerEnable").checked) return;
    const ms = Math.max(20, Number($("timerMs").value || 1000));
    $("timerMs").value = ms;
    timerId = setInterval(sendPacket, ms);
    $("sendStatus").textContent = "定时发送 " + ms + " ms";
  }

  function clampInt(value, min, max, fallback) {
    const n = Math.round(Number(value));
    if (!Number.isFinite(n)) return fallback;
    return Math.min(max, Math.max(min, n));
  }

  function defaultStringRows() {
    return [
      { enabled: true, name: "AT", mode: "ascii", value: "AT\\r\\n", interval: 300 },
      { enabled: true, name: "版本", mode: "ascii", value: "AT+GMR\\r\\n", interval: 500 },
      { enabled: false, name: "Modbus 示例", mode: "hex", value: "01 03 00 00 00 02 C4 0B", interval: 1000 }
    ];
  }

  function normalizeRow(row, index) {
    return {
      id: Number(row.id) || nextRowId++,
      enabled: row.enabled !== false,
      name: String(row.name || ("条目 " + (index + 1))).slice(0, 32),
      mode: row.mode === "hex" ? "hex" : "ascii",
      value: String(row.value || ""),
      interval: clampInt(row.interval, 0, 600000, 1000)
    };
  }

  function loadStringRows() {
    try {
      const saved = localStorage.getItem(rowsStorageKey);
      const parsed = saved ? JSON.parse(saved) : null;
      const rows = Array.isArray(parsed?.rows) ? parsed.rows : defaultStringRows();
      stringRows = rows.map(normalizeRow);
    } catch (err) {
      stringRows = defaultStringRows().map(normalizeRow);
    }
    nextRowId = Math.max(1, ...stringRows.map(row => row.id)) + 1;
  }

  function saveStringRows() {
    const rows = stringRows.map(({ id, enabled, name, mode, value, interval }) => ({
      id, enabled, name, mode, value, interval
    }));
    try {
      localStorage.setItem(rowsStorageKey, JSON.stringify({ version: 1, rows }));
    } catch (err) {
      $("sendStatus").textContent = "保存条目失败";
    }
  }

  function rowById(id) {
    return stringRows.find(row => row.id === Number(id));
  }

  function setRowField(row, field, value) {
    if (!row) return;
    if (field === "enabled") row.enabled = Boolean(value);
    else if (field === "name") row.name = String(value).slice(0, 32);
    else if (field === "mode") row.mode = value === "hex" ? "hex" : "ascii";
    else if (field === "value") row.value = String(value);
    else if (field === "interval") row.interval = clampInt(value, 0, 600000, 1000);
    saveStringRows();
  }

