sunzhongmeng/ESP32-Tools/src/main.cpp
  function inputFor(row, field, value, type) {
    const input = document.createElement("input");
    input.dataset.field = field;
    input.value = value;
    input.type = type || "text";
    if (field === "enabled") {
      input.checked = row.enabled;
      input.className = "row-enable";
      input.type = "checkbox";
    }
    if (field === "value") input.className = "row-value";
    if (field === "interval") {
      input.className = "row-interval";
      input.min = "0";
      input.max = "600000";
      input.step = "10";
    }
    return input;
  }

  function renderStringRows() {
    const list = $("stringList");
    list.textContent = "";
    if (!stringRows.length) {
      const empty = document.createElement("div");
      empty.className = "row-empty";
      empty.textContent = "暂无条目";
      list.appendChild(empty);
      return;
    }

    for (const row of stringRows) {
      const item = document.createElement("div");
      item.className = "string-row";
      item.dataset.rowId = row.id;

      const enabled = inputFor(row, "enabled", "", "checkbox");
      const name = inputFor(row, "name", row.name);
      const mode = document.createElement("select");
      mode.dataset.field = "mode";
      for (const optionValue of ["ascii", "hex"]) {
        const option = document.createElement("option");
        option.value = optionValue;
        option.textContent = optionValue.toUpperCase();
        option.selected = row.mode === optionValue;
        mode.appendChild(option);
      }
      const value = inputFor(row, "value", row.value);
      const interval = inputFor(row, "interval", row.interval, "number");
      const send = document.createElement("button");
      send.dataset.action = "send";
      send.textContent = "发送";
      const del = document.createElement("button");
      del.dataset.action = "delete";
      del.className = "danger";
      del.textContent = "删除";

      item.append(enabled, name, mode, value, interval, send, del);
      list.appendChild(item);
    }
  }

  function addStringRow() {
    stringRows.push(normalizeRow({
      id: nextRowId++,
      enabled: true,
      name: "新条目",
      mode: "ascii",
      value: "",
      interval: 1000
    }, stringRows.length));
    saveStringRows();
    renderStringRows();
  }

  function buildRowBytes(row) {
    if (row.mode === "hex") return parseHexInput(row.value);
    return parseAsciiEscapes(row.value);
  }

  function sendStringRow(row) {
    if (!row) return false;
    let bytes;
    try {
      bytes = buildRowBytes(row);
    } catch (err) {
      $("sendStatus").textContent = row.name + ": " + err.message;
      return false;
    }
    return sendBytes(bytes, "TX " + row.name, row.mode);
  }

  function checkedStringRows() {
    return stringRows.filter(row => row.enabled);
  }

  function updateSequenceButtons() {
    $("multiSendBtn").disabled = sequenceRunning;
    $("multiLoopBtn").disabled = sequenceRunning;
    $("multiStopBtn").disabled = !sequenceRunning;
  }

  function stopStringSequence(message) {
    clearTimeout(sequenceTimer);
    sequenceTimer = null;
    sequenceRunning = false;
    sequenceLoop = false;
    updateSequenceButtons();
    if (message) $("sendStatus").textContent = message;
  }

  function runSequenceStep(rows, index) {
    if (!sequenceRunning) return;
    if (!rows.length) {
      stopStringSequence("没有勾选条目");
      return;
    }
    if (index >= rows.length) {
      if (sequenceLoop) {
        sequenceTimer = setTimeout(() => runSequenceStep(rows, 0), 0);
      } else {
        stopStringSequence("勾选条目发送完成");
      }
      return;
    }

    const row = rows[index];
    if (!sendStringRow(row)) {
      stopStringSequence("发送已停止");
      return;
    }
    const delayMs = clampInt(row.interval, 0, 600000, 1000);
    sequenceTimer = setTimeout(() => runSequenceStep(rows, index + 1), delayMs);
  }

  function startStringSequence(loop) {
    const rows = checkedStringRows().map(row => ({ ...row }));
    if (!rows.length) {
      $("sendStatus").textContent = "没有勾选条目";
      return;
    }
    stopStringSequence();
    sequenceRunning = true;
    sequenceLoop = loop;
    updateSequenceButtons();
    $("sendStatus").textContent = loop ? "循环发送已启动" : "顺序发送已启动";
    runSequenceStep(rows, 0);
  }

  function exportStringRows() {
    const rows = stringRows.map(({ enabled, name, mode, value, interval }) => ({
      enabled, name, mode, value, interval
    }));
    const blob = new Blob([JSON.stringify({ version: 1, rows }, null, 2)], { type: "application/json" });
    const url = URL.createObjectURL(blob);
    const link = document.createElement("a");
    link.href = url;
    link.download = "esp32-uart-strings.json";
    document.body.appendChild(link);
    link.click();
    link.remove();
    setTimeout(() => URL.revokeObjectURL(url), 800);
    $("sendStatus").textContent = "条目已导出";
  }

  function importStringRows(file) {
    if (!file) return;
    const reader = new FileReader();
    reader.onload = () => {
      try {
        const parsed = JSON.parse(String(reader.result || "{}"));
        const rows = Array.isArray(parsed) ? parsed : parsed.rows;
        if (!Array.isArray(rows)) throw new Error("文件格式不正确");
        stringRows = rows.map(normalizeRow);
        nextRowId = Math.max(1, ...stringRows.map(row => row.id)) + 1;
        saveStringRows();
        renderStringRows();
        $("sendStatus").textContent = "已导入 " + stringRows.length + " 条";
      } catch (err) {
        $("sendStatus").textContent = "导入失败: " + err.message;
      }
    };
    reader.readAsText(file);
  }

  function sendBreak() {
    const ms = clampInt($("breakMs").value, 1, 5000, 100);
    $("breakMs").value = ms;
    sendCommand("BREAK ms=" + ms);
  }

  $("applyBtn").addEventListener("click", () => {
    const cmd = [
      "CFG",
      "baud=" + Number($("baud").value || 115200),
      "data=" + $("dataBits").value,
      "parity=" + $("parity").value,
      "stop=" + $("stopBits").value,
      "rx=" + Number($("rxPin").value || 16),
      "tx=" + Number($("txPin").value || 17)
    ].join(" ");
    sendCommand(cmd);
  });

  $("sendBtn").addEventListener("click", sendPacket);
  $("clearBtn").addEventListener("click", () => {
    rxStore = [];
    rxView.textContent = "";
  });
  $("timerEnable").addEventListener("change", syncTimer);
  $("timerMs").addEventListener("change", syncTimer);
  $("stopTimerBtn").addEventListener("click", () => {
    $("timerEnable").checked = false;
    syncTimer();
  });
  $("breakBtn").addEventListener("click", sendBreak);
  $("addRowBtn").addEventListener("click", addStringRow);
  $("selectAllRowsBtn").addEventListener("click", () => {
    stringRows.forEach(row => row.enabled = true);
    saveStringRows();
    renderStringRows();
  });
  $("selectNoneRowsBtn").addEventListener("click", () => {
    stringRows.forEach(row => row.enabled = false);
    saveStringRows();
    renderStringRows();
  });
  $("multiSendBtn").addEventListener("click", () => startStringSequence(false));
  $("multiLoopBtn").addEventListener("click", () => startStringSequence(true));
  $("multiStopBtn").addEventListener("click", () => stopStringSequence("多字符串发送已停止"));
  $("exportRowsBtn").addEventListener("click", exportStringRows);
  $("importRowsBtn").addEventListener("click", () => $("importRowsFile").click());
  $("importRowsFile").addEventListener("change", event => {
    importStringRows(event.target.files && event.target.files[0]);
    event.target.value = "";
  });
  $("stringList").addEventListener("input", event => {
    const item = event.target.closest(".string-row");
    const row = item ? rowById(item.dataset.rowId) : null;
    if (!row || !event.target.dataset.field) return;
    setRowField(row, event.target.dataset.field, event.target.value);
  });
  $("stringList").addEventListener("change", event => {
    const item = event.target.closest(".string-row");
    const row = item ? rowById(item.dataset.rowId) : null;
    if (!row || !event.target.dataset.field) return;
    const value = event.target.type === "checkbox" ? event.target.checked : event.target.value;
    setRowField(row, event.target.dataset.field, value);
  });
  $("stringList").addEventListener("click", event => {
    const action = event.target.dataset.action;
    if (!action) return;
    const item = event.target.closest(".string-row");
    const row = item ? rowById(item.dataset.rowId) : null;
    if (action === "send") {
      sendStringRow(row);
    } else if (action === "delete" && row) {
      stringRows = stringRows.filter(item => item.id !== row.id);
      saveStringRows();
      renderStringRows();
    }
  });

  document.querySelectorAll("[data-rx-mode]").forEach(button => {
    button.addEventListener("click", () => {
      rxMode = button.dataset.rxMode;
      document.querySelectorAll("[data-rx-mode]").forEach(b => b.classList.toggle("active", b === button));
      renderRx();
    });
  });

  document.querySelectorAll("[data-tx-mode]").forEach(button => {
    button.addEventListener("click", () => {
      txMode = button.dataset.txMode;
      document.querySelectorAll("[data-tx-mode]").forEach(b => b.classList.toggle("active", b === button));
    });
  });

  loadStringRows();
  renderStringRows();
  updateSequenceButtons();
  connect();
})();
</script>
</body>
</html>
)HTML";

String sanitized(String value) {
  value.replace("|", "_");
  value.replace("=", "-");
  return value;
}

String u64ToString(uint64_t value) {
  char buffer[24];
  snprintf(buffer, sizeof(buffer), "%llu", (unsigned long long)value);
  return String(buffer);
}

String ipString() {
  return apMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
}

bool systemFaultActive() {
  return wifiFault || uartFault;
}

