sunzhongmeng/ESP32-Tools/src/main.cpp
uint8_t activeClientCount() {
  uint8_t count = 0;
  for (uint8_t i = 0; i < MAX_WS_CLIENTS; i++) {
    if (wsClients[i].active) count++;
  }
  return count;
}

String makeStatusMessage() {
  String msg;
  msg.reserve(180);
  msg += "STATUS|baud=";
  msg += uartSettings.baud;
  msg += "|data=";
  msg += uartSettings.dataBits;
  msg += "|parity=";
  msg += uartSettings.parity;
  msg += "|stop=";
  msg += uartSettings.stopBits;
  msg += "|rx=";
  msg += uartSettings.rxPin;
  msg += "|tx=";
  msg += uartSettings.txPin;
  msg += "|ip=";
  msg += ipString();
  msg += "|wifi=";
  msg += apMode ? "AP" : "STA";
  msg += "|ssid=";
  msg += sanitized(activeSsid);
  msg += "|select=";
  msg += staModeRequested ? "STA" : "AP";
  msg += "|fault=";
  msg += systemFaultActive() ? sanitized(lastFaultText.length() ? lastFaultText : "fault") : "none";
  msg += "|clients=";
  msg += activeClientCount();
  return msg;
}

String makeStatsMessage() {
  String msg;
  msg.reserve(80);
  msg += "STAT|rx=";
  msg += u64ToString(uartRxBytes);
  msg += "|tx=";
  msg += u64ToString(uartTxBytes);
  msg += "|clients=";
  msg += activeClientCount();
  return msg;
}

uint32_t serialConfigValue(uint8_t dataBits, char parity, uint8_t stopBits) {
  parity = (char)toupper((unsigned char)parity);
  if (dataBits == 5) {
    if (parity == 'E') return stopBits == 2 ? SERIAL_5E2 : SERIAL_5E1;
    if (parity == 'O') return stopBits == 2 ? SERIAL_5O2 : SERIAL_5O1;
    return stopBits == 2 ? SERIAL_5N2 : SERIAL_5N1;
  }
  if (dataBits == 6) {
    if (parity == 'E') return stopBits == 2 ? SERIAL_6E2 : SERIAL_6E1;
    if (parity == 'O') return stopBits == 2 ? SERIAL_6O2 : SERIAL_6O1;
    return stopBits == 2 ? SERIAL_6N2 : SERIAL_6N1;
  }
  if (dataBits == 7) {
    if (parity == 'E') return stopBits == 2 ? SERIAL_7E2 : SERIAL_7E1;
    if (parity == 'O') return stopBits == 2 ? SERIAL_7O2 : SERIAL_7O1;
    return stopBits == 2 ? SERIAL_7N2 : SERIAL_7N1;
  }
  if (parity == 'E') return stopBits == 2 ? SERIAL_8E2 : SERIAL_8E1;
  if (parity == 'O') return stopBits == 2 ? SERIAL_8O2 : SERIAL_8O1;
  return stopBits == 2 ? SERIAL_8N2 : SERIAL_8N1;
}

bool isFlashPin(int pin) {
  return pin >= 6 && pin <= 11;
}

bool validRxPin(int pin) {
  return pin >= 0 && pin <= 39 && !isFlashPin(pin);
}

bool validTxPin(int pin) {
  return pin >= 0 && pin <= 33 && !isFlashPin(pin);
}

bool outputCapablePin(int pin) {
  return pin >= 0 && pin <= 33 && !isFlashPin(pin);
}

void setWifiFault(const String &message) {
  wifiFault = true;
  lastFaultText = message;
}

void clearWifiFault() {
  wifiFault = false;
  if (!systemFaultActive()) lastFaultText = "";
}

void setUartFault(const String &message) {
  uartFault = true;
  lastFaultText = message;
}

void clearUartFault() {
  uartFault = false;
  if (!systemFaultActive()) lastFaultText = "";
}

void setupIndicatorPins() {
  systemLedAvailable = outputCapablePin(SYSTEM_LED_PIN);
  txLedAvailable = outputCapablePin(UART_TX_LED_PIN);
  rxLedAvailable = outputCapablePin(UART_RX_LED_PIN);

  if (systemLedAvailable) {
    pinMode(SYSTEM_LED_PIN, OUTPUT);
    digitalWrite(SYSTEM_LED_PIN, LOW);
  } else {
    Serial.println("Warning: system LED pin is not output-capable.");
  }

  if (txLedAvailable) {
    pinMode(UART_TX_LED_PIN, OUTPUT);
    digitalWrite(UART_TX_LED_PIN, LOW);
  } else {
    Serial.println("Warning: GPIO35 is input-only on ESP32-WROOM-32, TX LED output is disabled.");
  }

  if (rxLedAvailable) {
    pinMode(UART_RX_LED_PIN, OUTPUT);
    digitalWrite(UART_RX_LED_PIN, LOW);
  } else {
    Serial.println("Warning: RX LED pin is not output-capable.");
  }
}

void pulseLed(int pin, bool available, uint32_t &offAt) {
  if (!available) return;
  digitalWrite(pin, HIGH);
  offAt = millis() + UART_LED_PULSE_MS;
}

void pulseTxLed() {
  pulseLed(UART_TX_LED_PIN, txLedAvailable, txLedOffAt);
}

void pulseRxLed() {
  pulseLed(UART_RX_LED_PIN, rxLedAvailable, rxLedOffAt);
}

void servicePulseLed(int pin, bool available, uint32_t &offAt) {
  if (!available || offAt == 0) return;
  if ((int32_t)(millis() - offAt) >= 0) {
    digitalWrite(pin, LOW);
    offAt = 0;
  }
}

void serviceIndicators() {
  servicePulseLed(UART_TX_LED_PIN, txLedAvailable, txLedOffAt);
  servicePulseLed(UART_RX_LED_PIN, rxLedAvailable, rxLedOffAt);

  if (!systemLedAvailable) return;
  if (systemFaultActive()) {
    digitalWrite(SYSTEM_LED_PIN, HIGH);
    systemLedState = true;
    return;
  }

  if (millis() - lastSystemBlinkMs >= SYSTEM_LED_BLINK_MS) {
    lastSystemBlinkMs = millis();
    systemLedState = !systemLedState;
    digitalWrite(SYSTEM_LED_PIN, systemLedState ? HIGH : LOW);
  }
}

bool validateSettings(const UartSettings &settings, String &error) {
  if (settings.baud < 300 || settings.baud > 2000000) {
    error = "baud out of range";
    return false;
  }
  if (settings.dataBits < 5 || settings.dataBits > 8) {
    error = "data bits out of range";
    return false;
  }
  if (settings.parity != 'N' && settings.parity != 'E' && settings.parity != 'O') {
    error = "parity must be N/E/O";
    return false;
  }
  if (settings.stopBits != 1 && settings.stopBits != 2) {
    error = "stop bits must be 1 or 2";
    return false;
  }
  if (!validRxPin(settings.rxPin)) {
    error = "invalid RX GPIO";
    return false;
  }
  if (!validTxPin(settings.txPin)) {
    error = "invalid TX GPIO";
    return false;
  }
  return true;
}

bool applyUartSettings(const UartSettings &settings, String &error) {
  if (!validateSettings(settings, error)) return false;
  uartSettings = settings;
  BridgeSerial.end();
  delay(20);
  BridgeSerial.setRxBufferSize(4096);
  BridgeSerial.begin(
      uartSettings.baud,
      serialConfigValue(uartSettings.dataBits, uartSettings.parity, uartSettings.stopBits),
      uartSettings.rxPin,
      uartSettings.txPin);
  while (BridgeSerial.available()) BridgeSerial.read();
  return true;
}

bool sendUartBreakMs(uint32_t durationMs, String &error) {
  if (durationMs < 1 || durationMs > 5000) {
    error = "break ms must be 1..5000";
    return false;
  }
  if (!validTxPin(uartSettings.txPin)) {
    error = "invalid TX GPIO";
    return false;
  }

  BridgeSerial.flush();
  BridgeSerial.end();
  delay(2);
  pinMode(uartSettings.txPin, OUTPUT);
  digitalWrite(uartSettings.txPin, HIGH);
  delayMicroseconds(200);
  digitalWrite(uartSettings.txPin, LOW);
  delay(durationMs);
  digitalWrite(uartSettings.txPin, HIGH);
  delayMicroseconds(200);

  BridgeSerial.setRxBufferSize(4096);
  BridgeSerial.begin(
      uartSettings.baud,
      serialConfigValue(uartSettings.dataBits, uartSettings.parity, uartSettings.stopBits),
      uartSettings.rxPin,
      uartSettings.txPin);
  pulseTxLed();
  return true;
}

String getParamValue(const String &command, const char *key, const String &fallback) {
  String needle = String(key) + "=";
  int pos = command.indexOf(needle);
  if (pos < 0) return fallback;
  int start = pos + needle.length();
  int end = start;
  while (end < command.length()) {
    char c = command.charAt(end);
    if (c == ' ' || c == '|' || c == ';' || c == '\r' || c == '\n') break;
    end++;
  }
  return command.substring(start, end);
}

void resetWsFrame(WsClient &client) {
  client.state = WS_HEADER;
  client.header[0] = 0;
  client.header[1] = 0;
  client.headerPos = 0;
  memset(client.ext, 0, sizeof(client.ext));
  client.extNeeded = 0;
  client.extPos = 0;
  memset(client.mask, 0, sizeof(client.mask));
  client.maskPos = 0;
  client.opcode = 0;
  client.masked = false;
  client.payloadLen = 0;
  client.payloadPos = 0;
}

