sunzhongmeng/ESP32-Tools/src/main.cpp
void dropWsClient(uint8_t index) {
  if (index >= MAX_WS_CLIENTS) return;
  if (wsClients[index].active) {
    wsClients[index].tcp.stop();
    wsClients[index].active = false;
  }
  resetWsFrame(wsClients[index]);
}

bool writeAll(WiFiClient &client, const uint8_t *data, size_t len) {
  size_t written = 0;
  uint32_t started = millis();
  while (written < len && client.connected()) {
    size_t chunk = client.write(data + written, len - written);
    if (chunk > 0) {
      written += chunk;
      started = millis();
    } else {
      if (millis() - started > 120) return false;
      delay(1);
    }
  }
  return written == len;
}

bool sendWsFrame(WsClient &client, uint8_t opcode, const uint8_t *payload, size_t len) {
  if (!client.active || !client.tcp.connected()) return false;
  uint8_t header[10];
  size_t headerLen = 0;
  header[0] = 0x80 | (opcode & 0x0F);
  if (len <= 125) {
    header[1] = (uint8_t)len;
    headerLen = 2;
  } else if (len <= 65535) {
    header[1] = 126;
    header[2] = (uint8_t)((len >> 8) & 0xFF);
    header[3] = (uint8_t)(len & 0xFF);
    headerLen = 4;
  } else {
    header[1] = 127;
    uint64_t n = len;
    for (uint8_t i = 0; i < 8; i++) {
      header[2 + i] = (uint8_t)((n >> (56 - i * 8)) & 0xFF);
    }
    headerLen = 10;
  }

  if (!writeAll(client.tcp, header, headerLen)) return false;
  if (len > 0 && payload != nullptr && !writeAll(client.tcp, payload, len)) return false;
  return true;
}

bool sendWsText(WsClient &client, const String &message) {
  return sendWsFrame(client, 0x1, (const uint8_t *)message.c_str(), message.length());
}

void broadcastText(const String &message) {
  for (uint8_t i = 0; i < MAX_WS_CLIENTS; i++) {
    if (wsClients[i].active && !sendWsText(wsClients[i], message)) {
      dropWsClient(i);
    }
  }
}

void broadcastBinary(const uint8_t *data, size_t len) {
  if (len == 0) return;
  for (uint8_t i = 0; i < MAX_WS_CLIENTS; i++) {
    if (wsClients[i].active && !sendWsFrame(wsClients[i], 0x2, data, len)) {
      dropWsClient(i);
    }
  }
}

String headerValue(const String &request, const String &headerName) {
  String lowerRequest = request;
  lowerRequest.toLowerCase();
  String lowerName = headerName;
  lowerName.toLowerCase();
  lowerName += ":";
  int pos = lowerRequest.indexOf(lowerName);
  if (pos < 0) return "";
  int start = pos + lowerName.length();
  while (start < request.length()) {
    char c = request.charAt(start);
    if (c != ' ' && c != '\t') break;
    start++;
  }
  int end = request.indexOf('\r', start);
  if (end < 0) end = request.indexOf('\n', start);
  if (end < 0) end = request.length();
  String value = request.substring(start, end);
  value.trim();
  return value;
}

String readHttpRequest(WiFiClient &client) {
  String request;
  request.reserve(1800);
  uint32_t deadline = millis() + 1200;
  while (millis() < deadline && client.connected()) {
    while (client.available()) {
      char c = (char)client.read();
      request += c;
      if (request.endsWith("\r\n\r\n") || request.length() > 2400) return request;
    }
    delay(1);
  }
  return request;
}

String websocketAcceptKey(const String &key) {
  const char *guid = "258EAFA5-E914-47DA-95CA-C5AB0DC85B11";
  String source = key + guid;
  unsigned char sha[20];
  mbedtls_sha1_ret((const unsigned char *)source.c_str(), source.length(), sha);

  unsigned char encoded[64];
  size_t encodedLen = 0;
  mbedtls_base64_encode(encoded, sizeof(encoded), &encodedLen, sha, sizeof(sha));
  encoded[encodedLen] = '\0';
  return String((const char *)encoded);
}

void acceptWsClient() {
  WiFiClient incoming = wsServer.available();
  if (!incoming) return;
  incoming.setTimeout(2);
  incoming.setNoDelay(true);

  String request = readHttpRequest(incoming);
  String key = headerValue(request, "Sec-WebSocket-Key");
  if (key.length() == 0) {
    incoming.print("HTTP/1.1 400 Bad Request\r\nConnection: close\r\n\r\n");
    incoming.stop();
    return;
  }

  int slot = -1;
  for (uint8_t i = 0; i < MAX_WS_CLIENTS; i++) {
    if (!wsClients[i].active) {
      slot = i;
      break;
    }
  }
  if (slot < 0) {
    incoming.print("HTTP/1.1 503 Busy\r\nConnection: close\r\n\r\n");
    incoming.stop();
    return;
  }

  String accept = websocketAcceptKey(key);
  incoming.print("HTTP/1.1 101 Switching Protocols\r\n");
  incoming.print("Upgrade: websocket\r\n");
  incoming.print("Connection: Upgrade\r\n");
  incoming.print("Sec-WebSocket-Accept: ");
  incoming.print(accept);
  incoming.print("\r\n\r\n");

  wsClients[slot].tcp = incoming;
  wsClients[slot].active = true;
  wsClients[slot].lastSeen = millis();
  resetWsFrame(wsClients[slot]);
  sendWsText(wsClients[slot], "INFO|message=WebSocket connected");
  sendWsText(wsClients[slot], makeStatusMessage());
  broadcastText(makeStatsMessage());
}

void sendWsError(uint8_t clientIndex, const String &error) {
  if (clientIndex >= MAX_WS_CLIENTS || !wsClients[clientIndex].active) return;
  String msg = "ERROR|message=" + sanitized(error);
  sendWsText(wsClients[clientIndex], msg);
}

void handleTextCommand(uint8_t clientIndex, const uint8_t *payload, size_t len) {
  String command;
  command.reserve(len + 1);
  for (size_t i = 0; i < len; i++) command += (char)payload[i];
  command.trim();

  if (command == "GET") {
    sendWsText(wsClients[clientIndex], makeStatusMessage());
    sendWsText(wsClients[clientIndex], makeStatsMessage());
    return;
  }

  if (command.startsWith("CFG")) {
    UartSettings next = uartSettings;
    next.baud = (uint32_t)getParamValue(command, "baud", String(next.baud)).toInt();
    next.dataBits = (uint8_t)getParamValue(command, "data", String(next.dataBits)).toInt();
    String parityText = getParamValue(command, "parity", String(next.parity));
    parityText.toUpperCase();
    next.parity = parityText.length() ? parityText.charAt(0) : 'N';
    next.stopBits = (uint8_t)getParamValue(command, "stop", String(next.stopBits)).toInt();
    next.rxPin = getParamValue(command, "rx", String(next.rxPin)).toInt();
    next.txPin = getParamValue(command, "tx", String(next.txPin)).toInt();

    String error;
    if (!applyUartSettings(next, error)) {
      sendWsError(clientIndex, error);
      return;
    }
    sendWsText(wsClients[clientIndex], "INFO|message=UART updated");
    broadcastText(makeStatusMessage());
    return;
  }

  if (command.startsWith("BREAK")) {
    uint32_t durationMs = (uint32_t)getParamValue(command, "ms", "100").toInt();
    String error;
    if (!sendUartBreakMs(durationMs, error)) {
      sendWsError(clientIndex, error);
      return;
    }
    sendWsText(wsClients[clientIndex], "INFO|message=BREAK sent");
    broadcastText(makeStatsMessage());
    return;
  }

  sendWsError(clientIndex, "unknown command");
}

