sunzhongmeng/ESP32-Tools/src/main.cpp
void handleWsFrame(uint8_t clientIndex) {
  WsClient &client = wsClients[clientIndex];
  if (!client.active) return;

  switch (client.opcode) {
    case 0x1:
      handleTextCommand(clientIndex, client.payload, client.payloadPos);
      break;
    case 0x2:
      if (client.payloadPos > 0) {
        size_t written = BridgeSerial.write(client.payload, client.payloadPos);
        uartTxBytes += written;
        if (written > 0) pulseTxLed();
      }
      break;
    case 0x8:
      sendWsFrame(client, 0x8, nullptr, 0);
      dropWsClient(clientIndex);
      break;
    case 0x9:
      sendWsFrame(client, 0xA, client.payload, client.payloadPos);
      break;
    case 0xA:
      break;
    default:
      sendWsError(clientIndex, "unsupported frame");
      dropWsClient(clientIndex);
      break;
  }
}

void preparePayloadState(WsClient &client, uint8_t clientIndex) {
  if (client.payloadLen > WS_MAX_PAYLOAD) {
    sendWsError(clientIndex, "websocket payload too large");
    dropWsClient(clientIndex);
    return;
  }
  client.payloadPos = 0;
  if (client.masked) {
    client.maskPos = 0;
    client.state = WS_MASK;
  } else if (client.payloadLen == 0) {
    handleWsFrame(clientIndex);
    if (client.active) resetWsFrame(client);
  } else {
    client.state = WS_PAYLOAD;
  }
}

void serviceWsClient(uint8_t clientIndex) {
  WsClient &client = wsClients[clientIndex];
  if (!client.active) return;
  if (!client.tcp.connected()) {
    dropWsClient(clientIndex);
    return;
  }

  while (client.active && client.tcp.available()) {
    int raw = client.tcp.read();
    if (raw < 0) break;
    uint8_t b = (uint8_t)raw;
    client.lastSeen = millis();

    if (client.state == WS_HEADER) {
      client.header[client.headerPos++] = b;
      if (client.headerPos == 2) {
        bool fin = (client.header[0] & 0x80) != 0;
        client.opcode = client.header[0] & 0x0F;
        client.masked = (client.header[1] & 0x80) != 0;
        uint8_t len = client.header[1] & 0x7F;
        if (!fin) {
          sendWsError(clientIndex, "fragmented frames unsupported");
          dropWsClient(clientIndex);
          return;
        }
        if (!client.masked) {
          sendWsError(clientIndex, "client frame must be masked");
          dropWsClient(clientIndex);
          return;
        }
        if (len == 126) {
          client.extNeeded = 2;
          client.extPos = 0;
          client.payloadLen = 0;
          client.state = WS_EXTENDED_LEN;
        } else if (len == 127) {
          client.extNeeded = 8;
          client.extPos = 0;
          client.payloadLen = 0;
          client.state = WS_EXTENDED_LEN;
        } else {
          client.payloadLen = len;
          preparePayloadState(client, clientIndex);
        }
      }
    } else if (client.state == WS_EXTENDED_LEN) {
      client.ext[client.extPos++] = b;
      if (client.extPos == client.extNeeded) {
        uint64_t len = 0;
        for (uint8_t i = 0; i < client.extNeeded; i++) {
          len = (len << 8) | client.ext[i];
        }
        client.payloadLen = len;
        preparePayloadState(client, clientIndex);
      }
    } else if (client.state == WS_MASK) {
      client.mask[client.maskPos++] = b;
      if (client.maskPos == 4) {
        if (client.payloadLen == 0) {
          handleWsFrame(clientIndex);
          if (client.active) resetWsFrame(client);
        } else {
          client.state = WS_PAYLOAD;
        }
      }
    } else if (client.state == WS_PAYLOAD) {
      client.payload[client.payloadPos] = b ^ client.mask[client.payloadPos % 4];
      client.payloadPos++;
      if (client.payloadPos >= client.payloadLen) {
        handleWsFrame(clientIndex);
        if (client.active) resetWsFrame(client);
      }
    }
  }
}

void serviceWsClients() {
  acceptWsClient();
  for (uint8_t i = 0; i < MAX_WS_CLIENTS; i++) {
    serviceWsClient(i);
  }
}

void handleSerialToWeb() {
  static uint8_t buffer[UART_RX_BATCH];
  static size_t len = 0;
  static uint32_t lastByteMs = 0;

  while (BridgeSerial.available() && len < sizeof(buffer)) {
    int value = BridgeSerial.read();
    if (value < 0) break;
    buffer[len++] = (uint8_t)value;
    lastByteMs = millis();
  }

  if (len > 0 && (len == sizeof(buffer) || millis() - lastByteMs >= 5)) {
    uartRxBytes += len;
    broadcastBinary(buffer, len);
    pulseRxLed();
    len = 0;
  }
}

String apName() {
  return String(AP_SSID);
}

bool hasConfiguredWifi() {
  return strlen(STA_WIFI_SSID) > 0 && strcmp(STA_WIFI_SSID, "YOUR_WIFI_SSID") != 0;
}

void startAccessPoint() {
  apMode = true;
  activeSsid = apName();
  WiFi.mode(WIFI_AP);
  WiFi.softAP(activeSsid.c_str(), AP_PASSWORD);
  Serial.print("AP SSID: ");
  Serial.println(activeSsid);
  Serial.print("AP IP: ");
  Serial.println(WiFi.softAPIP());
}

void setupWifi() {
  WiFi.persistent(false);
  WiFi.setSleep(false);

  pinMode(WIFI_MODE_SELECT_PIN, INPUT);
  delay(10);
  staModeRequested = digitalRead(WIFI_MODE_SELECT_PIN) == HIGH;

  Serial.print("WiFi mode select GPIO");
  Serial.print(WIFI_MODE_SELECT_PIN);
  Serial.print(": ");
  Serial.println(staModeRequested ? "HIGH, use STA" : "LOW, use AP");

  if (staModeRequested && hasConfiguredWifi()) {
    Serial.print("Connecting to WiFi: ");
    Serial.println(STA_WIFI_SSID);
    WiFi.mode(WIFI_STA);
    if (!WiFi.config(STA_STATIC_IP, STA_GATEWAY, STA_SUBNET, STA_DNS1, STA_DNS2)) {
      Serial.println("Warning: static IP config failed.");
    }
    WiFi.begin(STA_WIFI_SSID, STA_WIFI_PASSWORD);
    uint32_t started = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - started < 15000) {
      serviceIndicators();
      delay(300);
      Serial.print(".");
    }
    Serial.println();
    if (WiFi.status() == WL_CONNECTED) {
      apMode = false;
      activeSsid = STA_WIFI_SSID;
      clearWifiFault();
      Serial.print("STA IP: ");
      Serial.println(WiFi.localIP());
      Serial.print("Gateway: ");
      Serial.println(WiFi.gatewayIP());
      return;
    }

    setWifiFault("STA connect failed, fallback AP");
    Serial.println("STA connect failed, fallback to AP.");
  } else if (staModeRequested) {
    setWifiFault("STA selected but WiFi credentials missing");
    Serial.println("STA selected but WiFi credentials are missing.");
  }

