sunzhongmeng/ESP32-Tools/src/main.cpp
  if (!staModeRequested) clearWifiFault();
  startAccessPoint();
}

void maintainWifi() {
  if (apMode || !staModeRequested || !hasConfiguredWifi()) return;
  if (WiFi.status() == WL_CONNECTED) {
    clearWifiFault();
    return;
  }
  if (!wifiFault) setWifiFault("STA disconnected");
  if (millis() - lastReconnectMs < 10000) return;
  lastReconnectMs = millis();
  Serial.println("WiFi disconnected, reconnecting...");
  WiFi.disconnect();
  WiFi.begin(STA_WIFI_SSID, STA_WIFI_PASSWORD);
}

void handleRoot() {
  httpServer.send_P(200, "text/html; charset=utf-8", INDEX_HTML);
}

void handleStatusHttp() {
  httpServer.send(200, "text/plain; charset=utf-8", makeStatusMessage());
}

void handleNotFound() {
  httpServer.send(404, "text/plain; charset=utf-8", "Not found");
}

void setupHttp() {
  httpServer.on("/", HTTP_GET, handleRoot);
  httpServer.on("/api/status", HTTP_GET, handleStatusHttp);
  httpServer.onNotFound(handleNotFound);
  httpServer.begin();
  wsServer.begin();
}

void setupMdns() {
  if (MDNS.begin("esp32-uart")) {
    MDNS.addService("http", "tcp", HTTP_PORT);
    Serial.println("mDNS: http://esp32-uart.local/");
  }
}

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.println();
  Serial.println("ESP32 Wireless Web UART");
  setupIndicatorPins();

  String error;
  if (!applyUartSettings(uartSettings, error)) {
    setUartFault(error);
    Serial.print("UART setup error: ");
    Serial.println(error);
  } else {
    clearUartFault();
  }

  setupWifi();
  setupMdns();
  setupHttp();

  Serial.print("Open: http://");
  Serial.print(ipString());
  Serial.println("/");
  Serial.print("WebSocket port: ");
  Serial.println(WS_PORT);
}

void loop() {
  httpServer.handleClient();
  serviceWsClients();
  handleSerialToWeb();
  maintainWifi();
  serviceIndicators();

  if (millis() - lastStatsMs >= 1000) {
    lastStatsMs = millis();
    broadcastText(makeStatsMessage());
  }
}

#endif
